"""Выведите числа от 105 до 1 с шагом -25"""


for i in range(105, 0, -25):
    print(i)
