"""Создать список чисел от 2 до 15 с шагом 1."""


nums = range(2, 16, 1)
print(list(nums))
